In [54]:
import datetime

In [55]:

dt = datetime.datetime(2023, 1, 29, 9, 30)

In [56]:
one_hour_later = dt + datetime.timedelta(hours=1)

In [57]:
one_hour_later

datetime.datetime(2023, 1, 29, 10, 30)

In [58]:
one_day_earlier = dt - datetime.timedelta(days=1)

In [59]:
one_day_earlier

datetime.datetime(2023, 1, 28, 9, 30)

In [60]:
dt_now = datetime.datetime.now()

In [61]:
formatted_dt = dt.strftime("%d-%m-%Y %H:%M:%S")

In [62]:
formatted_dt

'29-01-2023 09:30:00'

In [63]:
str(str(datetime.datetime.now()).split(" ")[0])

'2023-04-27'

In [64]:
import pandas as pd

In [65]:
df = pd.DataFrame({"id":[1,2,3,4,5,6,7,8,9,10],
              "name":["hiten","manav","hardeep","akshy","sumit","varun","shubham","loyum","virat","sagar"],
              "date_of_joining":[datetime.datetime.now().strftime("%d-%m-%Y")]*10})

In [66]:
df

   id     name date_of_joining
0   1    hiten      27-04-2023
1   2    manav      27-04-2023
2   3  hardeep      27-04-2023
3   4    akshy      27-04-2023
4   5    sumit      27-04-2023
5   6    varun      27-04-2023
6   7  shubham      27-04-2023
7   8    loyum      27-04-2023
8   9    virat      27-04-2023
9  10    sagar      27-04-2023

In [67]:
todays_date = str(str(datetime.datetime.now()).split(" ")[0])

In [68]:
df['today'] = todays_date

In [69]:
df['today'] = pd.to_datetime(df['today'],dayfirst=True).dt.strftime('%Y-%m-%d')

In [70]:
df

   id     name date_of_joining       today
0   1    hiten      27-04-2023  2023-04-27
1   2    manav      27-04-2023  2023-04-27
2   3  hardeep      27-04-2023  2023-04-27
3   4    akshy      27-04-2023  2023-04-27
4   5    sumit      27-04-2023  2023-04-27
5   6    varun      27-04-2023  2023-04-27
6   7  shubham      27-04-2023  2023-04-27
7   8    loyum      27-04-2023  2023-04-27
8   9    virat      27-04-2023  2023-04-27
9  10    sagar      27-04-2023  2023-04-27

In [71]:
#range of date
pd.date_range(start="2023-01-01", periods=10)

DatetimeIndex(['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04',
               '2023-01-05', '2023-01-06', '2023-01-07', '2023-01-08',
               '2023-01-09', '2023-01-10'],
              dtype='datetime64[ns]', freq='D')

In [72]:
df['range_date'] = pd.date_range(start="2023-07-24", periods=10)

In [73]:
df

   id     name date_of_joining       today range_date
0   1    hiten      27-04-2023  2023-04-27 2023-07-24
1   2    manav      27-04-2023  2023-04-27 2023-07-25
2   3  hardeep      27-04-2023  2023-04-27 2023-07-26
3   4    akshy      27-04-2023  2023-04-27 2023-07-27
4   5    sumit      27-04-2023  2023-04-27 2023-07-28
5   6    varun      27-04-2023  2023-04-27 2023-07-29
6   7  shubham      27-04-2023  2023-04-27 2023-07-30
7   8    loyum      27-04-2023  2023-04-27 2023-07-31
8   9    virat      27-04-2023  2023-04-27 2023-08-01
9  10    sagar      27-04-2023  2023-04-27 2023-08-02

In [74]:
#wheather_df
import pandas as pd
import numpy as np

w_df = pd.DataFrame(np.random.rand(10,2)*5,
                    index = pd.date_range(start="2023-01-01", periods=10),
                    columns = ["Tokyo","Beijing"])

w_df.head()

               Tokyo   Beijing
2023-01-01  1.730270  4.743177
2023-01-02  0.480068  2.302572
2023-01-03  1.562949  3.172551
2023-01-04  0.993468  4.136705
2023-01-05  3.405610  3.277551

In [75]:
# to add days, months, years, etc
from datetime import date, timedelta
from dateutil.relativedelta import relativedelta

In [76]:
date.today()

datetime.date(2023, 4, 27)

In [77]:
date.today() + timedelta(days=400)

datetime.date(2024, 5, 31)

In [78]:
date.today() + relativedelta(days=400)

datetime.date(2024, 5, 31)

In [79]:
date.today() + relativedelta(years=7)

datetime.date(2030, 4, 27)

In [80]:
date.today() + relativedelta(months=4)

datetime.date(2023, 8, 27)

In [81]:
df

   id     name date_of_joining       today range_date
0   1    hiten      27-04-2023  2023-04-27 2023-07-24
1   2    manav      27-04-2023  2023-04-27 2023-07-25
2   3  hardeep      27-04-2023  2023-04-27 2023-07-26
3   4    akshy      27-04-2023  2023-04-27 2023-07-27
4   5    sumit      27-04-2023  2023-04-27 2023-07-28
5   6    varun      27-04-2023  2023-04-27 2023-07-29
6   7  shubham      27-04-2023  2023-04-27 2023-07-30
7   8    loyum      27-04-2023  2023-04-27 2023-07-31
8   9    virat      27-04-2023  2023-04-27 2023-08-01
9  10    sagar      27-04-2023  2023-04-27 2023-08-02

In [82]:
#adding 5 years to each date of column date_of_joining
df['date_of_joining'] = pd.to_datetime(df['date_of_joining'],dayfirst=True)
df['add_5yr'] = df['date_of_joining'].apply(lambda x : x+relativedelta(years=5))

In [83]:
df

   id     name date_of_joining       today range_date    add_5yr
0   1    hiten      2023-04-27  2023-04-27 2023-07-24 2028-04-27
1   2    manav      2023-04-27  2023-04-27 2023-07-25 2028-04-27
2   3  hardeep      2023-04-27  2023-04-27 2023-07-26 2028-04-27
3   4    akshy      2023-04-27  2023-04-27 2023-07-27 2028-04-27
4   5    sumit      2023-04-27  2023-04-27 2023-07-28 2028-04-27
5   6    varun      2023-04-27  2023-04-27 2023-07-29 2028-04-27
6   7  shubham      2023-04-27  2023-04-27 2023-07-30 2028-04-27
7   8    loyum      2023-04-27  2023-04-27 2023-07-31 2028-04-27
8   9    virat      2023-04-27  2023-04-27 2023-08-01 2028-04-27
9  10    sagar      2023-04-27  2023-04-27 2023-08-02 2028-04-27